app/controllers/authentication_controller.rb

SELECT * FROM `users` WHERE (active and username = 'bruno' and password = '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92') LIMIT 1
SELECT * FROM `sponsors` WHERE (active and username = 'joao' and password = '5994471abb01112afcc18159f6cc74b4f511b99806da59b3caf5a9c173cacfc5') LIMIT 1
---
  def home
    if session[:u_id].blank? and session[:s_id].blank?
      user = User.find(:first, :conditions => "active and username = '#{params[:user]}' and password = '#{Digest::SHA256.hexdigest(params[:password])}'")
      #Se não encontrar um usuário, um patrocinador será buscado
      user = Sponsor.find(:first, :conditions => "active and username = '#{params[:user]}' and password = '#{Digest::SHA256.hexdigest(params[:password])}'") if user.blank?