app/controllers/bulletins_controller.rb

  def create
    bulletin = Bulletin.new(params[:bulletin])
    bulletin.user_id = user_session.id
    if bulletin.save
---
INSERT INTO `bulletins` (`title`, `user_id`, `date`) VALUES('Boletim semana #1', 1, '2011-01-09')

  def edit
    @bulletin = Bulletin.find(params[:id])
---
SELECT * FROM `bulletins` WHERE (`bulletins`.`id` = 1)

  def update
    bulletin = Bulletin.find(params[:id])
    if bulletin.update_attributes(params[:bulletin])
---
SELECT * FROM `bulletins` WHERE (`bulletins`.`id` = 1)
UPDATE `bulletins` SET `title` = 'Boletim semanal #1' WHERE `id` = 1

  def show
    @bulletin = Bulletin.find(params[:id])
    @interfaces = Interface.find(:all, :order => "name")
---
SELECT * FROM `bulletins` WHERE (`bulletins`.`id` = 1)
SELECT * FROM `interfaces` WHERE (`interfaces`.`id` = 1)

  def save_part
    if params[:part_id].blank?
      #Criar uma nova parte
      part = BulletinPart.new(params[:bulletin_part])
      part.bulletin_id = params[:id]
    else
      #Editar uma parte
      part = BulletinPart.find(params[:part_id])
      part.attributes = params[:bulletin_part]
    end

    unless part.save
      flash[:error] = erro(part)
    end

    @bulletin = Bulletin.find(params[:id])
---
SELECT * FROM `bulletin_parts` WHERE (`bulletin_parts`.bulletin_id = 1)
INSERT INTO `bulletin_parts` (`title`, `bulletin_id`, `interface_id`, `sequence_number`) VALUES('Teatro aps', 1, 1, 1)
UPDATE `bulletin_parts` SET `title` = 'Teatro aps' WHERE `id` = 1
SELECT * FROM `bulletins` WHERE (`bulletins`.`id` = 1)

  def edit_part
    @part = BulletinPart.find(params[:part_id])
---
SELECT * FROM `bulletin_parts` WHERE (`bulletin_parts`.`id` = 1)

  def delete_part
    part = BulletinPart.find(params[:part_id])
    unless part.destroy
      flash[:error] = erro(part)
    end
    @bulletin = Bulletin.find(params[:id])
---
SELECT * FROM `bulletin_parts` WHERE (`bulletin_parts`.bulletin_id = 1)
DELETE FROM `bulletin_parts` WHERE `id` = 1
SELECT * FROM `bulletins` WHERE (`bulletins`.`id` = 1)

  def show_part
    @part = BulletinPart.find(params[:part_id])
---
SELECT * FROM `bulletin_parts` WHERE (`bulletin_parts`.`id` = 2)

  def add_txt
    @part = BulletinPart.find(params[:part_id])
---
SELECT * FROM `bulletin_parts` WHERE (`bulletin_parts`.`id` = 2)

  def save_txt
    part_txt = BulletinText.new(params[:bulletin_text])
    part_txt.bulletin_part_id = params[:part_id]
    unless part_txt.save
      flash[:error] = erro(part_txt)
    else
      flash[:notice] = "Texto adicionado com sucesso."
    end

    @part = BulletinPart.find(params[:part_id])
---
INSERT INTO `bulletin_texts` (`text`, `bulletin_part_id`) VALUES('Lorem Ipsum is simply dummy text of the printing and typesetting industry. Lorem Ipsum has been the industry\'s standard dummy text ever since the 1500s, when an unknown printer took a galley of type and scrambled it to make a type specimen book. It has survived not only five centuries, but also the leap into electronic typesetting, remaining essentially unchanged. It was popularised in the 1960s with the release of Letraset sheets containing Lorem Ipsum passages, and more recently with desktop publishing software like Aldus PageMaker including versions of Lorem Ipsum', 2)
SELECT * FROM `bulletin_parts` WHERE (`bulletin_parts`.`id` = 2)

  def delete_txt
    part_txt = BulletinText.find(params[:txt_id])
    unless part_txt.destroy
      flash[:error] = erro(part_txt)
    end
    @part = BulletinPart.find(params[:part_id])
---
SELECT * FROM `bulletin_texts` WHERE (`bulletin_texts`.bulletin_part_id = 2)
DELETE FROM `bulletin_texts` WHERE `id` = 1
SELECT * FROM `bulletin_parts` WHERE (`bulletin_parts`.`id` = 2)

  def add_img
    @part = BulletinPart.find(params[:part_id])
---
SELECT * FROM `bulletin_parts` WHERE (`bulletin_parts`.`id` = 2)

  def save_img
    part_img = BulletinImage.new(params[:bulletin_image])
    part_img.bulletin_part_id = params[:part_id]
    unless part_img.save
---
INSERT INTO `bulletin_images` (`image_file_name`, `bulletin_part_id`) VALUES('teatro.jpg', 2)

  def delete_img
    part_img = BulletinImage.find(params[:img_id])
    unless part_img.destroy
      flash[:error] = erro(part_img)
    end
    @part = BulletinPart.find(params[:part_id])
---
SELECT * FROM `bulletin_images` WHERE (`bulletin_images`.bulletin_part_id = 2)
DELETE FROM `bulletin_images` WHERE `id` = 1
SELECT * FROM `bulletin_parts` WHERE (`bulletin_parts`.`id` = 2)

  def show_in_layout
    @bulletin = Bulletin.find(params[:id])
---
SELECT * FROM `bulletins` WHERE (`bulletins`.`id` = 1)