app/controllers/emails_controller.rb

INSERT INTO `emails` (`email`, `date`) VALUES('bruno.rails@gmail.com', '2010-12-31')
---
  def create
    email = Email.new(params[:email])
    if email.save

SELECT * FROM `emails` WHERE (`emails`.`id` = 1)
---
  def edit
    @email = Email.find(params[:id])

SELECT * FROM `emails` WHERE (`emails`.`id` = 1)
UPDATE `emails` SET `email` = 'bruno.xxrails@gmail.com' WHERE `id` = 1
---
  def update
    email = Email.find(params[:id])
    if email.update_attributes(params[:email])

SELECT * FROM `emails` WHERE (`emails`.`id` = 2)
DELETE FROM `emails` WHERE `id` = 2
---
  def destroy
    email = Email.find(params[:id])
    email.destroy ? flash[:notice] = "Email deletado." : flash[:error] = erro(email)