app/controllers/interfaces_controller.rb

INSERT INTO `interfaces` (`name`, `width`) VALUES('Layout 1', '500')
---
  def create
    interface = Interface.new(params[:interface])
    if interface.save

SELECT * FROM `interfaces` WHERE (`interfaces`.`id` = 1)
---
  def edit
    @interface = Interface.find(params[:id])

SELECT * FROM `interfaces` WHERE (`interfaces`.`id` = 1)
UPDATE `interfaces` SET `width` = '480' WHERE `id` = 1
---
  def update
    interface = Interface.find(params[:id])
    if interface.update_attributes(params[:interface])

SELECT * FROM `interfaces` WHERE (`interfaces`.`id` = 1)
---
  def show
    @interface = Interface.find(params[:id])

SELECT * FROM `components` WHERE (`components`.interface_id = 1)
INSERT INTO `components` (`interface_id`, `ident`, `width`, `height`, `top`, `right`, `bottom`, `left`, `image`) VALUES(1, '1', '1', '1', '', '', '', '', 1)
UPDATE `components` SET `top` = '500', `bottom` = '' WHERE `id` = 12
SELECT * FROM `interfaces` WHERE (`interfaces`.`id` = 1)
---
  def save_component
    if params[:component_id].blank?
      #Criando um novo componente
      @component = Component.new(params[:componente])
    else
      #Editando um componente existente
      @component = Component.find(params[:component_id])
      @component.attributes = params[:componente]
    end
    unless @component.save
      flash[:error] = erro(@component)
    end

    @interface = Interface.find(params[:id])

SELECT * FROM `components` WHERE (`components`.`id` = 1)
---
  def edit_component
    @component = Component.find(params[:component_id])

SELECT * FROM `components` WHERE (`components`.interface_id = 1)
DELETE FROM `components` WHERE `id` = 4
SELECT * FROM `interfaces` WHERE (`interfaces`.`id` = 1)
---
  def remove_component
    component = Component.find(params[:component_id])
    unless component.destroy
      flash[:error] = erro(component)
    end
    @interface = Interface.find(params[:id])