app/controllers/messages_controller.rb

  def create
    mensagem = Message.new(params[:mensagem])
    user_session.class == User ? mensagem.user_id = user_session.id : mensagem.sponsor_id = user_session.id
    if mensagem.save
---
INSERT INTO `messages` (`title`, `text`, `ident`, `date`, `user_id`, `sponsor_id`, `message_id`, `deleted_by_user`, `deleted_by_sponsor`, `readed`) VALUES('Teste', 'Mais um teste aqui.', 'M', '2011-01-07 23:40:45', NULL, 1, NULL, NULL, NULL, 0)

  def show
    @mensagem = Message.find(params[:id])
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 1)

  def destroy
    mensagem = Message.find(params[:id])
    user_session.class == User ? mensagem.deleted_by_user = DateTime.now : mensagem.deleted_by_sponsor = DateTime.now
    mensagem.save ? flash[:notice] = "Mensagem deletada." : flash[:error] = erro(mensagem)
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 4)
UPDATE `messages` SET `deleted_by_sponsor` = '2011-01-07 21:42:50' WHERE `id` = 4