app/controllers/sponsors_controller.rb

SELECT * FROM `sponsors` WHERE (`sponsors`.`id` = 1)
UPDATE `sponsors` SET `active` = 0, `password` = '6baad6f126fa53233f5120dd32225d4a9eeaea26dce58789f0b3b6efcdb0dadb' WHERE `id` = 1
---
  def inativar
    sponsor = Sponsor.find(params[:id])
    sponsor.active = false
    if sponsor.save

SELECT * FROM `sponsors` WHERE (`sponsors`.`id` = 1)
UPDATE `sponsors` SET `active` = 1, `password` = '06f67fd63dd76fa88393c7c2b35416a5778f7ea1b9165bc20b7d09be65adb8af' WHERE `id` = 1
---
  def ativar
    sponsor = Sponsor.find(params[:id])
    sponsor.active = true
    if sponsor.save

INSERT INTO `sponsors` (`username`, `password`, `name`, `company`, `email`, `phone`, `cell_phone`, `address`, `city`, `date`, `active`) VALUES('joao', '5994471abb01112afcc18159f6cc74b4f511b99806da59b3caf5a9c173cacfc5', 'João Pedra', 'Construção LTDA', 'joao.construcao@gmail.com', '6233145268', '6294582617', 'Rua dos anciões', 'Anápolis', '2010-12-31', 1)
---
  def create
    sponsor = Sponsor.new(params[:sponsor])
    if sponsor.save

SELECT * FROM `sponsors` WHERE (`sponsors`.`id` = 1)
---
  def edit
    @sponsor = Sponsor.find(params[:id])

SELECT * FROM `sponsors` WHERE (`sponsors`.`id` = 1)
UPDATE `sponsors` SET `password` = '5994471abb01112afcc18159f6cc74b4f511b99806da59b3caf5a9c173cacfc5' WHERE `id` = 1
---
  def update
    sponsor = Sponsor.find(params[:id])
    if sponsor.update_attributes(params[:sponsor])

SELECT * FROM `sponsors` WHERE (`sponsors`.`id` = 0)
---
  def show
    @sponsor = Sponsor.find(params[:id])