app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (active) ORDER BY name
---
  def index
    @users = User.find(:all, :order => "active desc, name")

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `active` = 0, `password` = '173af653133d964edfc16cafe0aba33c8f500a07f3ba3f81943916910c257705' WHERE `id` = 1
---
  def inativar
    user = User.find(params[:id])
    user.active = false
    if user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `active` = 1, `password` = '1f707cd9f1548819257c8f0b432af46955e4e351a7a61236388eb5bd27cdba7c' WHERE `id` = 1
---
  def ativar
    user = User.find(params[:id])
    user.active = true
    if user.save

INSERT INTO `users` (`username`, `password`, `name`, `date`, `active`, `delta`) VALUES('teste', '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92', 'Nome de teste', '2010-12-24', 1, 0)
---
  def create
    user = User.new(params[:user])
    if user.save

SELECT * FROM `users` WHERE (`users`.`id` = 3)
UPDATE `users` SET `name` = 'Priscyla Linda meu amor', `password` = '8d969eef6ecad3c29a3a629280e686cf0c3f5d5a86aff3ca12020c923adc6c92' WHERE `id` = 3
---
  def update
    user = User.find(params[:id])
    if user.update_attributes(params[:user])